HelloDuoLA/esp32_ble/components/PikaPython/pikascript-api/__pikaBinding.c
void PikaStdDevice_PWM_platformDisableMethod(PikaObj *self, Args *args){
    PikaStdDevice_PWM_platformDisable(self);
}
method_typedef(
    PikaStdDevice_PWM_platformDisable,
    "platformDisable", ""
);

void PikaStdDevice_PWM_platformEnableMethod(PikaObj *self, Args *args){
    PikaStdDevice_PWM_platformEnable(self);
}
method_typedef(
    PikaStdDevice_PWM_platformEnable,
    "platformEnable", ""
);

void PikaStdDevice_PWM_platformSetDutyMethod(PikaObj *self, Args *args){
    PikaStdDevice_PWM_platformSetDuty(self);
}
method_typedef(
    PikaStdDevice_PWM_platformSetDuty,
    "platformSetDuty", ""
);

void PikaStdDevice_PWM_platformSetFrequencyMethod(PikaObj *self, Args *args){
    PikaStdDevice_PWM_platformSetFrequency(self);
}
method_typedef(
    PikaStdDevice_PWM_platformSetFrequency,
    "platformSetFrequency", ""
);

void PikaStdDevice_PWM_setChannelMethod(PikaObj *self, Args *args){
    int ch = args_getInt(args, "ch");
    PikaStdDevice_PWM_setChannel(self, ch);
}
method_typedef(
    PikaStdDevice_PWM_setChannel,
    "setChannel", "ch"
);

void PikaStdDevice_PWM_setDutyMethod(PikaObj *self, Args *args){
    pika_float duty = args_getFloat(args, "duty");
    PikaStdDevice_PWM_setDuty(self, duty);
}
method_typedef(
    PikaStdDevice_PWM_setDuty,
    "setDuty", "duty"
);

void PikaStdDevice_PWM_setFreqMethod(PikaObj *self, Args *args){
    int freq = args_getInt(args, "freq");
    PikaStdDevice_PWM_setFreq(self, freq);
}
method_typedef(
    PikaStdDevice_PWM_setFreq,
    "setFreq", "freq"
);

void PikaStdDevice_PWM_setFrequencyMethod(PikaObj *self, Args *args){
    int freq = args_getInt(args, "freq");
    PikaStdDevice_PWM_setFrequency(self, freq);
}
method_typedef(
    PikaStdDevice_PWM_setFrequency,
    "setFrequency", "freq"
);

void PikaStdDevice_PWM_setNameMethod(PikaObj *self, Args *args){
    char* name = args_getStr(args, "name");
    PikaStdDevice_PWM_setName(self, name);
}
method_typedef(
    PikaStdDevice_PWM_setName,
    "setName", "name"
);

void PikaStdDevice_PWM_setPinMethod(PikaObj *self, Args *args){
    char* pin = args_getStr(args, "pin");
    PikaStdDevice_PWM_setPin(self, pin);
}
method_typedef(
    PikaStdDevice_PWM_setPin,
    "setPin", "pin"
);

class_def(PikaStdDevice_PWM){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdDevice_PWM_setDuty, 203183351),
    method_def(PikaStdDevice_PWM_setFreq, 203251455),
    method_def(PikaStdDevice_PWM_setName, 203520690),
    method_def(PikaStdDevice_PWM_platformSetDuty, 215133052),
    method_def(PikaStdDevice_PWM_close, 255564379),
    method_def(PikaStdDevice_PWM_disable, 314893497),
    method_def(PikaStdDevice_PWM_platformDisable, 326843198),
    method_def(PikaStdDevice_PWM_setPin, 461696568),
    method_def(PikaStdDevice_PWM_setChannel, 680132682),
    method_def(PikaStdDevice_PWM_platformEnable, 835227025),
    method_def(PikaStdDevice_PWM___init__, 904762485),
    method_def(PikaStdDevice_PWM_setFrequency, 1182403779),
    method_def(PikaStdDevice_PWM_getDuty, 1885436907),
    method_def(PikaStdDevice_PWM_getName, 1885774246),
    method_def(PikaStdDevice_PWM_getChannel, 2013999806),
    method_def(PikaStdDevice_PWM_platformSetFrequency, 2060729960),
    method_def(PikaStdDevice_PWM_getFrequency, 2064755767),
    method_def(PikaStdDevice_PWM_enable, 2071294892),
};
class_inhert(PikaStdDevice_PWM, PikaStdDevice_BaseDev);

PikaObj *New_PikaStdDevice_PWM(Args *args){
    PikaObj *self = New_PikaStdDevice_BaseDev(args);
    obj_setClass(self, PikaStdDevice_PWM);
    return self;
}

Arg *PikaStdDevice_PWM(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdDevice_PWM);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDEVICE_DISABLE
void PikaStdDevice_SPI___init__Method(PikaObj *self, Args *args){
    PikaStdDevice_SPI___init__(self);
}
method_typedef(
    PikaStdDevice_SPI___init__,
    "__init__", ""
);

void PikaStdDevice_SPI_disableMethod(PikaObj *self, Args *args){
    PikaStdDevice_SPI_disable(self);
}
method_typedef(
    PikaStdDevice_SPI_disable,
    "disable", ""
);

void PikaStdDevice_SPI_enableMethod(PikaObj *self, Args *args){
    PikaStdDevice_SPI_enable(self);
}
method_typedef(
    PikaStdDevice_SPI_enable,
    "enable", ""
);

void PikaStdDevice_SPI_platformDisableMethod(PikaObj *self, Args *args){
    PikaStdDevice_SPI_platformDisable(self);
}
method_typedef(
    PikaStdDevice_SPI_platformDisable,
    "platformDisable", ""
);

void PikaStdDevice_SPI_platformEnableMethod(PikaObj *self, Args *args){
    PikaStdDevice_SPI_platformEnable(self);
}
method_typedef(
    PikaStdDevice_SPI_platformEnable,
    "platformEnable", ""
);

void PikaStdDevice_SPI_platformReadMethod(PikaObj *self, Args *args){
    PikaStdDevice_SPI_platformRead(self);
}
method_typedef(
    PikaStdDevice_SPI_platformRead,
    "platformRead", ""
);

void PikaStdDevice_SPI_platformReadBytesMethod(PikaObj *self, Args *args){
    PikaStdDevice_SPI_platformReadBytes(self);
}
method_typedef(
    PikaStdDevice_SPI_platformReadBytes,
    "platformReadBytes", ""
);

void PikaStdDevice_SPI_platformWriteMethod(PikaObj *self, Args *args){
    PikaStdDevice_SPI_platformWrite(self);
}
method_typedef(
    PikaStdDevice_SPI_platformWrite,
    "platformWrite", ""
);

void PikaStdDevice_SPI_platformWriteBytesMethod(PikaObj *self, Args *args){
    PikaStdDevice_SPI_platformWriteBytes(self);
}
method_typedef(
    PikaStdDevice_SPI_platformWriteBytes,
    "platformWriteBytes", ""
);

void PikaStdDevice_SPI_readMethod(PikaObj *self, Args *args){
    int length = args_getInt(args, "length");
    char* res = PikaStdDevice_SPI_read(self, length);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdDevice_SPI_read,
    "read", "length"
);

void PikaStdDevice_SPI_readBytesMethod(PikaObj *self, Args *args){
    int length = args_getInt(args, "length");
    Arg* res = PikaStdDevice_SPI_readBytes(self, length);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdDevice_SPI_readBytes,
    "readBytes", "length"
);

void PikaStdDevice_SPI_setBaudRateMethod(PikaObj *self, Args *args){
    int baudRate = args_getInt(args, "baudRate");
    PikaStdDevice_SPI_setBaudRate(self, baudRate);
}
method_typedef(
    PikaStdDevice_SPI_setBaudRate,
    "setBaudRate", "baudRate"
);

void PikaStdDevice_SPI_setIdMethod(PikaObj *self, Args *args){
    int id = args_getInt(args, "id");
    PikaStdDevice_SPI_setId(self, id);
}
method_typedef(
    PikaStdDevice_SPI_setId,
    "setId", "id"
);

void PikaStdDevice_SPI_setNameMethod(PikaObj *self, Args *args){
    char* name = args_getStr(args, "name");
    PikaStdDevice_SPI_setName(self, name);
}
method_typedef(
    PikaStdDevice_SPI_setName,
    "setName", "name"
);

void PikaStdDevice_SPI_setPhaseMethod(PikaObj *self, Args *args){
    int phase = args_getInt(args, "phase");
    PikaStdDevice_SPI_setPhase(self, phase);
}
method_typedef(
    PikaStdDevice_SPI_setPhase,
    "setPhase", "phase"
);

