HelloDuoLA/esp32_ble/components/PikaPython/pikascript-api/__pikaBinding.c
class_inhert(PikaStdLib_SysObj, TinyObj);

PikaObj *New_PikaStdLib_SysObj(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdLib_SysObj);
    return self;
}

Arg *PikaStdLib_SysObj(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdLib_SysObj);
}
#endif

#ifndef PIKA_MODULE_PIKASTDTASK_DISABLE
void PikaStdTask_TaskMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdTask_Task(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdTask_Task,
    "Task", ""
);

class_def(PikaStdTask){
    __BEFORE_MOETHOD_DEF
    constructor_def(PikaStdTask_Task, 2089601848),
};
class_inhert(PikaStdTask, TinyObj);

PikaObj *New_PikaStdTask(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdTask);
    return self;
}
#endif

#ifndef PIKA_MODULE_PIKASTDTASK_DISABLE
void PikaStdTask_Task___init__Method(PikaObj *self, Args *args){
    PikaStdTask_Task___init__(self);
}
method_typedef(
    PikaStdTask_Task___init__,
    "__init__", ""
);

void PikaStdTask_Task_call_alwaysMethod(PikaObj *self, Args *args){
    Arg* fun_todo = args_getArg(args, "fun_todo");
    PikaStdTask_Task_call_always(self, fun_todo);
}
method_typedef(
    PikaStdTask_Task_call_always,
    "call_always", "fun_todo"
);

void PikaStdTask_Task_call_period_msMethod(PikaObj *self, Args *args){
    Arg* fun_todo = args_getArg(args, "fun_todo");
    int period_ms = args_getInt(args, "period_ms");
    PikaStdTask_Task_call_period_ms(self, fun_todo, period_ms);
}
method_typedef(
    PikaStdTask_Task_call_period_ms,
    "call_period_ms", "fun_todo,period_ms"
);

void PikaStdTask_Task_call_whenMethod(PikaObj *self, Args *args){
    Arg* fun_todo = args_getArg(args, "fun_todo");
    Arg* fun_when = args_getArg(args, "fun_when");
    PikaStdTask_Task_call_when(self, fun_todo, fun_when);
}
method_typedef(
    PikaStdTask_Task_call_when,
    "call_when", "fun_todo,fun_when"
);

void PikaStdTask_Task_platformGetTickMethod(PikaObj *self, Args *args){
    PikaStdTask_Task_platformGetTick(self);
}
method_typedef(
    PikaStdTask_Task_platformGetTick,
    "platformGetTick", ""
);

void PikaStdTask_Task_run_foreverMethod(PikaObj *self, Args *args){
    PikaStdTask_Task_run_forever(self);
}
method_typedef(
    PikaStdTask_Task_run_forever,
    "run_forever", ""
);

void PikaStdTask_Task_run_onceMethod(PikaObj *self, Args *args){
    PikaStdTask_Task_run_once(self);
}
method_typedef(
    PikaStdTask_Task_run_once,
    "run_once", ""
);

void PikaStdTask_Task_run_until_msMethod(PikaObj *self, Args *args){
    int until_ms = args_getInt(args, "until_ms");
    PikaStdTask_Task_run_until_ms(self, until_ms);
}
method_typedef(
    PikaStdTask_Task_run_until_ms,
    "run_until_ms", "until_ms"
);

class_def(PikaStdTask_Task){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdTask_Task_run_forever, 408322738),
    method_def(PikaStdTask_Task_run_until_ms, 854930212),
    method_def(PikaStdTask_Task___init__, 904762485),
    method_def(PikaStdTask_Task_call_always, 1368427953),
    method_def(PikaStdTask_Task_call_period_ms, 1674236450),
    method_def(PikaStdTask_Task_run_once, 1726949022),
    method_def(PikaStdTask_Task_platformGetTick, 1897947957),
    method_def(PikaStdTask_Task_call_when, 2141638002),
};
class_inhert(PikaStdTask_Task, PikaStdLib_SysObj);

PikaObj *New_PikaStdTask_Task(Args *args){
    PikaObj *self = New_PikaStdLib_SysObj(args);
    obj_newObj(self, "calls", "PikaStdData_List", New_PikaStdData_List);
    obj_setClass(self, PikaStdTask_Task);
    return self;
}

Arg *PikaStdTask_Task(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdTask_Task);
}
#endif

#ifndef PIKA_MODULE__TIME_DISABLE
void _time___init__Method(PikaObj *self, Args *args){
    _time___init__(self);
}
method_typedef(
    _time___init__,
    "__init__", ""
);

void _time_asctimeMethod(PikaObj *self, Args *args){
    _time_asctime(self);
}
method_typedef(
    _time_asctime,
    "asctime", ""
);

void _time_ctimeMethod(PikaObj *self, Args *args){
    pika_float unix_time = args_getFloat(args, "unix_time");
    _time_ctime(self, unix_time);
}
method_typedef(
    _time_ctime,
    "ctime", "unix_time"
);

void _time_gmtimeMethod(PikaObj *self, Args *args){
    pika_float unix_time = args_getFloat(args, "unix_time");
    _time_gmtime(self, unix_time);
}
method_typedef(
    _time_gmtime,
    "gmtime", "unix_time"
);

void _time_localtimeMethod(PikaObj *self, Args *args){
    pika_float unix_time = args_getFloat(args, "unix_time");
    _time_localtime(self, unix_time);
}
method_typedef(
    _time_localtime,
    "localtime", "unix_time"
);

void _time_mktimeMethod(PikaObj *self, Args *args){
    int res = _time_mktime(self);
    method_returnInt(args, res);
}
method_typedef(
    _time_mktime,
    "mktime", ""
);

void _time_platformGetTickMethod(PikaObj *self, Args *args){
    _time_platformGetTick(self);
}
method_typedef(
    _time_platformGetTick,
    "platformGetTick", ""
);

void _time_sleep_msMethod(PikaObj *self, Args *args){
    int ms = args_getInt(args, "ms");
    _time_sleep_ms(self, ms);
}
method_typedef(
    _time_sleep_ms,
    "sleep_ms", "ms"
);

void _time_sleep_sMethod(PikaObj *self, Args *args){
    int s = args_getInt(args, "s");
    _time_sleep_s(self, s);
}
method_typedef(
    _time_sleep_s,
    "sleep_s", "s"
);

void _time_timeMethod(PikaObj *self, Args *args){
    pika_float res = _time_time(self);
    method_returnFloat(args, res);
}
method_typedef(
    _time_time,
    "time", ""
);

void _time_time_nsMethod(PikaObj *self, Args *args){
    int res = _time_time_ns(self);
    method_returnInt(args, res);
}
method_typedef(
    _time_time_ns,
    "time_ns", ""
);

class_def(_time){
    __BEFORE_MOETHOD_DEF
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(_time_gmtime, 1586568),
#endif
    method_def(_time_sleep_ms, 164842493),
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(_time_mktime, 234027084),
#endif
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(_time_ctime, 255845143),
#endif
    method_def(_time_sleep_s, 460522064),
    method_def(_time___init__, 904762485),
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(_time_localtime, 907356095),
#endif
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(_time_asctime, 1108526539),
#endif
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(_time_time_ns, 1644053204),
#endif
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(_time_platformGetTick, 1897947957),
#endif
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(_time_time, 2090760340),
#endif
};
class_inhert(_time, TinyObj);

PikaObj *New__time(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, _time);
    return self;
}
#endif

