HelloDuoLA/esp32_ble/components/PikaPython/pikascript-api/__pikaBinding.c
#ifndef PIKA_MODULE_BLUETOOTH_DISABLE
void bluetooth_BLEMethod(PikaObj *self, Args *args){
    Arg* res = bluetooth_BLE(self);
    method_returnArg(args, res);
}
method_typedef(
    bluetooth_BLE,
    "BLE", ""
);

class_def(bluetooth){
    __BEFORE_MOETHOD_DEF
    constructor_def(bluetooth_BLE, 193451448),
};
class_inhert(bluetooth, TinyObj);

PikaObj *New_bluetooth(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, bluetooth);
    return self;
}
#endif

#ifndef PIKA_MODULE_BLUETOOTH_DISABLE
void bluetooth_BLE_activeMethod(PikaObj *self, Args *args){
    bluetooth_BLE_active(self);
}
method_typedef(
    bluetooth_BLE_active,
    "active", ""
);

void bluetooth_BLE_gap_advertiseMethod(PikaObj *self, Args *args){
    bluetooth_BLE_gap_advertise(self);
}
method_typedef(
    bluetooth_BLE_gap_advertise,
    "gap_advertise", ""
);

void bluetooth_BLE_initMethod(PikaObj *self, Args *args){
    bluetooth_BLE_init(self);
}
method_typedef(
    bluetooth_BLE_init,
    "init", ""
);

void bluetooth_BLE_testMethod(PikaObj *self, Args *args){
    bluetooth_BLE_test(self);
}
method_typedef(
    bluetooth_BLE_test,
    "test", ""
);

class_def(bluetooth_BLE){
    __BEFORE_MOETHOD_DEF
    method_def(bluetooth_BLE_gap_advertise, 487130755),
    method_def(bluetooth_BLE_active, 1902398945),
    method_def(bluetooth_BLE_init, 2090370361),
    method_def(bluetooth_BLE_test, 2090756197),
};
class_inhert(bluetooth_BLE, TinyObj);

PikaObj *New_bluetooth_BLE(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, bluetooth_BLE);
    return self;
}

Arg *bluetooth_BLE(PikaObj *self){
    return obj_newObjInPackage(New_bluetooth_BLE);
}
#endif

#ifndef PIKA_MODULE_MYTEST_DISABLE
void mytest_MYTESTMethod(PikaObj *self, Args *args){
    Arg* res = mytest_MYTEST(self);
    method_returnArg(args, res);
}
method_typedef(
    mytest_MYTEST,
    "MYTEST", ""
);

class_def(mytest){
    __BEFORE_MOETHOD_DEF
    constructor_def(mytest_MYTEST, 1106641515),
};
class_inhert(mytest, TinyObj);

PikaObj *New_mytest(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, mytest);
    return self;
}
#endif

#ifndef PIKA_MODULE_MYTEST_DISABLE
void mytest_MYTEST_testMethod(PikaObj *self, Args *args){
    mytest_MYTEST_test(self);
}
method_typedef(
    mytest_MYTEST_test,
    "test", ""
);

class_def(mytest_MYTEST){
    __BEFORE_MOETHOD_DEF
    method_def(mytest_MYTEST_test, 2090756197),
};
class_inhert(mytest_MYTEST, TinyObj);

PikaObj *New_mytest_MYTEST(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, mytest_MYTEST);
    return self;
}

Arg *mytest_MYTEST(PikaObj *self){
    return obj_newObjInPackage(New_mytest_MYTEST);
}
#endif

#ifndef PIKA_MODULE_PIKA_LIBC_DISABLE
class_def(pika_libc){
    __BEFORE_MOETHOD_DEF
};
class_inhert(pika_libc, TinyObj);

PikaObj *New_pika_libc(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, pika_libc);
    return self;
}
#endif

